## 10.1 GroupBy机制

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.297496 -2.561168
1    a  two -0.501809  0.667808
2    b  one  1.194963  0.669709
3    b  two -1.227024  0.835751
4    a  one  2.117474 -1.494748

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [6]:
grouped.mean()

key1
a    0.106056
b   -0.016031
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means

key1  key2
a     one     0.409989
      two    -0.501809
b     one     1.194963
      two    -1.227024
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a     0.409989 -0.501809
b     1.194963 -1.227024

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [11]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.501809
            2006    1.194963
Ohio        2005   -1.262260
            2006    2.117474
Name: data1, dtype: float64

In [12]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.106056 -1.129369
b    -0.016031  0.752730

In [13]:
df

  key1 key2     data1     data2
0    a  one -1.297496 -2.561168
1    a  two -0.501809  0.667808
2    b  one  1.194963  0.669709
3    b  two -1.227024  0.835751
4    a  one  2.117474 -1.494748

In [15]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.409989 -2.027958
     two  -0.501809  0.667808
b    one   1.194963  0.669709
     two  -1.227024  0.835751

In [16]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### 对分组进行迭代

In [17]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.297496 -2.561168
1    a  two -0.501809  0.667808
4    a  one  2.117474 -1.494748
b
  key1 key2     data1     data2
2    b  one  1.194963  0.669709
3    b  two -1.227024  0.835751

In [18]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.297496 -2.561168
4    a  one  2.117474 -1.494748
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.501809  0.667808
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.194963  0.669709
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.227024  0.835751